<script setup lang="ts">
import { ref, type Ref } from 'vue'
import ArticleContainer from './ArticleContainer.vue'
const source: Ref<string> = ref(
  '![301631420735.jpg](https://s2.loli.net/2024/03/29/TXkzqQ1SjgsHmd7.jpg)\n\n嘿，那边的！那个摇滚小子！”其中一个混混向他大喊：“今晚的演出真不错！唱得真棒！”强尼心不在焉地挥了挥手。是啊，今天的这场演出是很棒，即使在强尼的印象里也没几场演出能赶得上今天——但是演出已经结束了，喊再多安可也没用。\n\n那几个混混向强尼走过来，其中一个摇晃着酒瓶。不知哪里来的强光穿透了玻璃，泛着黄光的龙舌兰酒液胡乱撞击着酒瓶内壁，有几滴从瓶口溅了出来。“你！强尼·银手！”那个个子比较小的，脸上纹着非洲部落纹身的混混说，“往这边来！再来场这么棒的演出怎么样？让我们大伙再开心开心！”看着那几个混混走得越来越近，强尼用自己的肉手把女友奥特护在身侧。“嘿，溜冰的，”他注意到他们的神情和语气看似另有所图，于是说道，“你们的建议很棒，但是刚才那场演唱持续太久了。我现在真的没兴趣、也没体力再来一回了。明晚我再来表演怎么样？”这时，混混们已经与强尼几乎贴在一起了。强尼把那把瓦尔特9毫米手枪从枪套里抽出并握在手里。也许不会有事，他想。\n\n“好呀！明晚再来！”混混中的大个子刚刚热情地说完“来”字，三个混混就突然对强尼发起进攻。他们出手速度太快，只看得到残影挥动。强尼果断开枪，瓦尔特手枪在这个小巷的一角中爆出轰鸣，喷射而出的子弹撞击到墙壁上——可惜，射偏了，谁也没打中。小个子混混举起有道金属划痕的手——那是由反射着寒光的剃刀组成的拳头伪装成的一只手。然后，伴随着一阵剧痛，强尼被打飞了。混凝土上溅满了他的鲜血，剧烈的冲击折断了他好几块骨头。他的眼睛暗淡无神地望着天空，眼里不见丝毫神采。他女友奥特惊恐的尖叫很快消失在黑暗中。8秒内，一切归于沉寂。\n\n不久，强尼恢复了知觉。他感觉好像有些玻璃碎片在他的肠子里搅动。天空中，赤红色的云层遮蔽了冰冷的蓝色霓虹。他挪动了一下身躯，感觉地面黏糊糊的。\n\n那是他的血。\n\n一只猫从垃圾桶上跳下来，绕着强尼的身体小心翼翼地爬行着。这只猫可不是笨蛋，在这场冲突它毫发无伤。强尼看着它，它的小巧眼睛仿佛是对红色LED灯，不带丝毫亲近，咕噜咕噜地转动着。得瑟的家伙，强尼这么想着，然后闭上了他的双眼。\n\n在他的眼皮下，虹膜上红色的数字信号显示着他生命剩下的时间。他的各项生命指征正在不断降低。汽车低鸣，开过这肮脏的，被雨水打湿的街道。远处，一辆创伤急救队^[一般情况下，他们只救助他们的客户]的救护车呼啸着驶来，不过不是来救他的。他的意识越来越模糊。\n\n强尼双目失神地看着头顶上空黑暗平坦的有星星点缀其中的穹顶。就在这座城市上空，热闪电微光与城市粉色灯光的光晕交相辉映。一架垂直起降（VTOL）机飞过他的头顶，巨大的螺旋桨鞭笞着夜晚。强尼下意识尝试着去触碰这架飞机，他伸出手，义手在这天空中画出清晰轮廓。这只华丽的高级义手向他闪烁着冰冷的银色光泽。他将那只标志性的金属手紧握成拳，机械的手指关节依次发出咔咔的声响。强尼把这只手塞进肚子开裂的伤口里，疼得喘不过气。可能是强大的意志力支撑着，他得以站了起来，蹒跚着走到小巷口。满是愤懑的脸靠在冰冷潮湿的砖墙上，强尼下定了决心：他绝不会在那些混混被他杀掉前死去！他撑不住了，合上眼睛，无力的身躯倒向了向眼前高速川流、划出残影的车流。\n\n然而，有什么东西止住了强尼倒下。一双手牢牢地抓住了他，把他搀扶起来。强尼用他最后的力气睁开双眼，一张瘦瘦的，留着胡子的脸正专注地看着他。“我的天，”这张脸说话了，“他们居然把你打成这样!\n\n强尼来不及回应，他的世界再度陷入了一片漆黑。\n\n'
)
</script>

<template>
  <ArticleContainer :source="source" />
</template>

<style scoped></style>
